source/_posts/2015-11-07-the-best-way-to-teach-others-emacs.html
---
title: "The best way to teach others Emacs"
date: 2015-11-07
layout: post
categories: 
- Emacs
tags: 
- Emacs
published: true
comments: 
---
<p>
安利 Emacs 的正确方式：
</p>

<p>
第一步：找到一个对 Emacs 真正感兴趣的人。（这是最难的一步）
</p>

<p>
第二步：让他把 Emacs 自带的教程看完（C-h t），并且给他们一些 Youtube 视频教程。
</p>

<p>
第三步：让他放弃学习 Emacs，并且安利他去学习 Vim。
</p>

<p>
第四步：等上十来年。
</p>

<p>
第五步：十来年后，此 Vim 党想重新尝试 Emacs 了，而且这一次他懂得自己去找资料学习了。
</p>

<p>
第六步：终于，他成功学会了 Emacs，而你什么也没干。
</p>

<p>
2333333
</p>

<p>
上面的段子来自 reddit：
</p>

<p>
<a href="https://www.reddit.com/r/emacs/comments/3r1z7p/in_your_experience_what_was_the_best_way_to_teach/">https://www.reddit.com/r/emacs/comments/3r1z7p/in_your_experience_what_was_the_best_way_to_teach/</a>
</p>

<p>
<!-- more -->
</p>

<p>
那到底我们（Emacser）要不要安利呢？ 这是一个问题。
</p>

<p>
另外，什么样的安利姿势才是正确的呢？
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">不要在安利的时候说 Emacs 可以做任何事情。</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
没错，Emacs 就是一个操作系统，它可以完成任何事情！
</p>

<p>
map(#<code>[%]</code>(str % 千万不要对一个没有入 Emacs 党的人过早地透露这个秘密), [但是，但是，但是])。（重要的事情说三遍）。
</p>

<p>
我曾经试图这样做，但是，不管我说什么，他们总能找到反驳我的理由。
</p>

<p>
我说 Emacs 也可以打造成 Python IDE。（你这个有 PyCharm 牛比吗？不能调试打断点吧，哈哈。）
</p>

<p>
我说 Emacs 也可以打造成 C/C++的 IDE。（你这个有 VS 牛比吗？VS 是世界上最好的 IDE！）
</p>

<p>
我说 Emacs 还可以煮咖啡！！！（你妹！你煮给我看看！！）擦。。
</p>

<p>
所以，下次安利的时候不要再对人说 Emacs 可以做任何事情了。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">不要安利对方快捷键使用和无鼠标操作方式</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
下次安利 Emacs 的时候，请让他用鼠标！请让他用上下左右键！只有 Vim 党才会宣称 hjkl 比上下左右好使，全键盘流是效率最高的，我们需要的是肌肉记忆。
</p>

<p>
（没错，上面说的我全部赞同，并且我也是一个资深的 Vim 党。）
</p>

<p>
但是，如果他是一个 资深 Vim 党，你千万不能给他安利 Emacs，原因你懂的。而其它编辑器党都是喜欢并且离不开鼠标的。
</p>

<p>
Emacs 支持鼠标操作，而且也鼓励使用鼠标。比如菜单选择，Minor mode 关闭都可以用鼠标来操作。
</p>

<p>
另外，不要传达出 Emacs 快捷键很虐人的信号，比如 Ctrl 键到死。。。（事实上也确实如此）
</p>

<p>
多介绍 which-key 和 hydra，鼓吹 helm 和 ido 的操作方式，让他放弃学习 Emacs 的原生快捷键。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">要安利 Emacs 是一个编程平台</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
Emacs 是一个非常好玩的 Lisp 运行时，而且 Emacs Lisp 非常有趣。只有你用了才能体会 Happy Hacking 的乐趣，并且你有可能会乐此不疲。
</p>

<p>
看完《 The little scheme 》，你会深刻理解程序递归是什么。然后，你会中括号毒，然后你会想玩 Clojure。然后，就一发不可收拾了。
</p>

<p>
另外，Emacs 是一种生活方式。
</p>

<p>
你试过用 Org mode 做 GTD 来管理你的时间吗？（<a href="https://github.com/zilongshanren/Spacemacs-rocks/issues/2">Spacemacs Rocks(2): 使用 Org-mode 做 GTD · Issue #2 · zilongshanren/Spacemacs-rocks</a>)
</p>

<p>
你试过直接在 Emacs 里面运行终端模式器，然后在此模拟器里面输入 vim .emacs 来修改你的 emacs 配置里面的 bug 吗？
</p>

<p>
你试过在 Emacs 里面使用 IRC 和收发邮件吗？
</p>

<p>
Emacs 是一个操作系统，只是它缺少一个好用的编辑器。
</p>

<p>
不过现在 Spacemacs 打开了新的局面，你们（Vim 党和其它党）准备好了吗？
</p>
</div>
</div>
